{"inkVersion":21,"root":[["\n",{"->":"birdcargo"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"birdcargo":[["^Finding a warehouse by the side of the highway is kind of like a jackpot. Your party also agrees. Who knows what you could find in there!","\n","^So, you all go out to investigate, after having Gatorhead break down the door, of course. You are all met with the sight of a bunch of crates, some stacked on top of one another and some scattered across the floor.","\n","^There’s a crate immediately to your left that’s half opened. As you’re about to head for it, Leslie bumps against a tower of crates, which sends one of them spilling over right in front of you.","\n","ev","str","^ Look at Crate ","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^ Look at Spillage ","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"left"},"\n",{"#f":5}],"c-1":["^ ",{"->":"right"},"\n",{"#f":5}]}],{"#f":1}],"left":["^You dig your hand around, and what you find among the package filling is a triangular, metallic object.","\n","^It has a few small nuts and bolts, an opening that looks like a mouth, but nothing other than that. Is this scrap?","\n",{"->":"group"},{"#f":1}],"right":["^You crouch down next to the spillage, and start to look for anything particularly shiny and interesting among more regular-looking trinkets.","\n","^Eventually, what you find is a flat, misshapen metallic object. It has a few dents, some nuts and bolts, and a hook that would probably connect this object to another.","\n","^There’s another one just like it at the bottom of the crate. Nothing else other than that. Is this scrap?","\n",{"->":"group"},{"#f":1}],"group":[["^At the same time, your party members are also questioning their findings.","\n","^Apparently, Leslie found something that looked like a small, spherical metal head. Lady found two thinner, stick-like pieces of metal.","\n","^Gatorhead found a bigger version of what Leslie described, but instead with two hooks at the sides, and a few holes.","\n","^You come together, and the pieces reveal… a bird?","\n","^You can hear Gatorhead swear under his breath.","\n","^It seems that bird parts are kept in this warehouse. There isn’t anything else to be understood from this.","\n","^The others are already suggesting to go back to the van, as Gatorhead looks - somehow - increasingly more disturbed. Something something, <i>‘birds aren’t real?</i>","\n","ev","str","^ Stay and Search Further ","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^ Go Back ","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"search"},"\n",{"#f":5}],"c-1":["^ ",{"->":"leave"},"\n",{"#f":5}]}],{"#f":1}],"search":["^You decide to stay and look some more through the crates. The others half-heartedly join the search.","\n","^Eventually, you pull out a flat, rectangular object from a crate in the back of the room. It reads: <b>B1RDM4N_0956…</b> and a series of numbers. The chip on the back tells you that it’s readable.","\n","^<b> [ Item Received: Keycard. Provides access to a secret location. ] </b>","\n",{"->":"leave"},{"#f":1}],"leave":["^You decide to go back to the van. Gatorhead is still mumbling to himself.","\n","^You can’t help but feel bad that you exposed an animal lover (of sorts) to this kind of cold truth, but Leslie says he’ll be alright once he has a beer or something. Lady’s nod indicates doubt in that sentiment.","\n","end",{"#f":1}],"setTestValue":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"testValue","re":true},{"#f":1}],"setGatorHeadInParty":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"has_GatorHead","re":true},{"#f":1}],"setSamInParty":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"has_Sam","re":true},{"#f":1}],"setCharisma":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_constitution","re":true},{"#f":1}],"setWisdom":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_wisdom","re":true},{"#f":1}],"setConstitution":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_constitution","re":true},{"#f":1}],"setMoxie":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_moxie","re":true},{"#f":1}],"setGumption":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_gumption","re":true},{"#f":1}],"global decl":["ev",false,{"VAR=":"has_side_kick"},false,{"VAR=":"has_brick"},"str","^","/str",{"VAR=":"player_name"},"str","^","/str",{"VAR=":"puppy_kicked"},"str","^Kicked","/str",{"VAR=":"puppy_status"},false,{"VAR=":"has_GatorHead"},false,{"VAR=":"has_Sam"},0,{"VAR=":"player_constitution"},0,{"VAR=":"player_wisdom"},0,{"VAR=":"player_charisma"},0,{"VAR=":"player_moxie"},0,{"VAR=":"player_gumption"},0,{"VAR=":"testValue"},"/ev","end",null],"#f":1}],"listDefs":{}}