{"inkVersion":21,"root":[["\n",{"->":"race"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"race":[["^There is a lot of oinking to be heard in this section of the road. Upon driving closer, you notice a crowd of 7 or so people huddled around a small race track, where pigs are racing each other to run a full loop.","\n","^Someone from the crowd notices your van pulling up, and waves you over. Once you’re close enough, they explain to you the rules, regardless of whether you’re actually interested or not: you pick a hog, if they win, you win. It loses, you lose. Simple.","\n","^The stranger also gives you a description of each hog:","\n","^<i>Roo</i> is the smallest, the fastest, but gets the most distracted. It’s very likely that Roo will stop at one point to gnaw at rocks. Has tripped out the other hogs before.","\n","^<i>Beebee</i> is the biggest, and also the slowest. There’s been multiple occasions where Beebee has almost run over the other hogs. Beebee’s a bulldozer.","\n","^<i>Toot</i> is about average-sized. Farts a lot. They’re deadly.","\n","ev","str","^Bet on Roo","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Bet on Beebee","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Bet on Toot","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"betRoo"},{"#f":5}],"c-1":["\n",{"->":"betBeebee"},{"#f":5}],"c-2":["\n",{"->":"betToot"},"ev",1,3,"rnd","/ev",{"temp=":"bet"},"\n","ev",{"VAR?":"bet"},{"VAR?":"roo"},"==","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"betRoo"},{"->":".^.^.^.15"},null]}],"nop","\n","ev",{"VAR?":"bet"},{"VAR?":"bee"},"==","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"betBeebee"},{"->":".^.^.^.23"},null]}],"nop","\n","ev",{"VAR?":"bet"},{"VAR?":"too"},"==","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"betToot"},{"->":".^.^.^.31"},null]}],"nop","\n",{"#f":5}]}],{"#f":1}],"betRoo":["^The race begins! You watch as Roo zips past the two others before stopping, as predicted. It is distracted by some shiny trinkets that some stranger has dropped not far from it.","\n","^Its eyes glow with the desire to lick metal... and in the process, trips out Beebee. The big pig falls on its behind with its legs in the air.","\n","^Toot on the other hand... has barely left the start line, rubbing its butt against it. Everyone turns their heads up at the stench.","\n","^Roo gets bored eventually, having not noticed what just happened behind it, and rolls its way to the finish line, earning oohs and aahs.","\n","^But, still, you won! You didn’t expect your chosen hog-steed to win the race, but you’re all the more better for it.","\n","ev",14,{"x()":"causeEvent","exArgs":1},"pop","/ev","\n","^You can hear whoop-whoops as you return to the van. ","#","^spr pigrace2","/#","\n","end",{"#f":1}],"loss":["^You've lost. You see the stranger who'd spoken to you earlier grin with glee, extending an open hand to you. Not a handshake, but a <i>pay up</i> sort of gesture. You begrudgingly oblige.","\n","ev",13,{"x()":"causeEvent","exArgs":1},"pop","/ev","\n","^You get a few shoulder pats as you return to the van, and a haughty grin from Leslie. She would've probably bet on something different. ","#","^spr pigpace2","/#","\n","end",{"#f":1}],"betBeebee":["^The race begins! You see Beebee slowly but surely inch its way from the start line, almost crushing Toot in the process, who has barely moved its legs.","\n","^As Toot lets out a toot, Beebee is getting closer to the speedster Roo, but the moment Roo stops, Beebee <i>rams</i> into it, sending the big pig barrelling backwards with its feet in the air.","\n","^You let out a sigh. Roo casually trots its way to the finish line, and Beebee hasn't had a moment to roll around. Unfortunate.","\n",{"->":"loss"},{"#f":1}],"betToot":["^The race begins! You're waiting for Toot to move just as the other two hogs are but... what is Toot doing?","\n","^Toot is dragging its butt in place, spreading a deadly, nose-scrunching stench <i>everywhere.</i>","\n","^While not deadly for the pigs, it's deadly for the betters around, who you can see are growing increasingly paler. You hold your nose with your hand.","\n","^The other two pigs are almost neck-to-neck, up until Beebee barrels into Roo after a sudden stop from the latter. You let out a sigh as Roo crosses the finish line, having licked the equivalent of pennies and all.","\n",{"->":"loss"},{"#f":1}],"setTestValue":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"testValue","re":true},{"#f":1}],"setGatorHeadInParty":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"has_GatorHead","re":true},{"#f":1}],"setSamInParty":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"has_Sam","re":true},{"#f":1}],"setCharisma":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_constitution","re":true},{"#f":1}],"setWisdom":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_wisdom","re":true},{"#f":1}],"setConstitution":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_constitution","re":true},{"#f":1}],"setMoxie":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_moxie","re":true},{"#f":1}],"setGumption":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_gumption","re":true},{"#f":1}],"global decl":["ev",false,{"VAR=":"has_side_kick"},false,{"VAR=":"has_brick"},"str","^","/str",{"VAR=":"player_name"},"str","^","/str",{"VAR=":"puppy_kicked"},"str","^Kicked","/str",{"VAR=":"puppy_status"},false,{"VAR=":"has_GatorHead"},false,{"VAR=":"has_Sam"},0,{"VAR=":"player_constitution"},0,{"VAR=":"player_wisdom"},0,{"VAR=":"player_charisma"},0,{"VAR=":"player_moxie"},0,{"VAR=":"player_gumption"},0,{"VAR=":"testValue"},false,{"VAR=":"has_keycard"},1,{"VAR=":"roo"},2,{"VAR=":"bee"},3,{"VAR=":"too"},"/ev","end",null],"#f":1}],"listDefs":{}}