{"inkVersion":21,"root":[["\n",{"->":"lostpledges"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"lostpledges":[["^You drive has been oddly uneventful for a while now. And almost as if someone'd heard you voice that thought out loud, you spot two figures by the side of the road playing catch with one another.","\n","^Getting closer, you hear faint laughter, when suddenly the football flies right above your windshield, even scraping the side of whatever's at the top of your van. Your party members nearly jolt awake.","\n","^Right after that, one of the figures rushes onto the highway. You're about to hit the brakes when the stranger, instead of advancing any further in the direction of the well-identified flying object, passes out heaving right in front of the car.","\n","^The other stranger is soon sprinting over - of course after going to get the football, because, <i>priorities</i> - kneeling and breathing heavily over the fainted.","\n","^\"Bro... Bro wake up! <i>Bro..........</i>\"","\n","ev","str","^ Help Out ","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^ Stay Put ","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"help"},"\n",{"#f":5}],"c-1":["^ ",{"->":"stay"},"\n",{"#f":5}]}],{"#f":1}],"help":["^Partially because of someone passing out <i>right there</i> - and <i>obviously</i> you don't want to drive them over - and partially because of your companions' sudden interest in this near-death scenario that had just unfolded, you step out of the car.","\n","^\"Right here!\" The stranger yells, even though you're not that far from him. \"Please help him. I don't know why he passed out....\" He turns to the fainted then, dejected. \"Bro...\"","\n","^You look back to your party members. Lady is shaking her head. Gatorhead on the other hand is trying to act out what to do, taking Leslie's shoulders and pretending he's slapping her, but theatrically. Leslie is grinning the entire time.","\n","^<i>Slap him? Is that what he's suggesting?</i>","\n","ev",{"VAR?":"player_constitution"},3,">","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"awake"},{"->":"help.15"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"uhoh"},{"->":"help.15"},null]}],"nop","\n",{"#f":1}],"awake":["ev",{"VAR?":"player_charisma"},1,"+",{"VAR=":"player_charisma","re":true},"/ev","^You crack your knuckles, and ignore the guy as he asks what you're about to do. You kneel against the fainted guy and ready your hand.","\n","^You don't know it, but Gatorhead and Leslie are cheering, for whatever reason.","\n","^<b><i>SLAP!!</b></i> It even echoes. You're awfully proud of that slap.","\n","^The guy wakes up, startled.","\n","^\"WOAH.\"","\n","^\"Bro!\" The other one exclaims. \"You passed out!\"","\n","^\"The heat, bro... It got me...\"","\n","^\"It got got you. For real.\"","\n","^What even is happening? You step back as they get up.","\n","^You finally note their clothing. Cropped jerseys with huge numbers at the front, short shorts... These are SADsOP members.","\n","^But judging by the lack of any other signifier, they could be pledges. Or wannabes really.","\n","^The one - who has just awoken - salutes you.","\n","^\"Thanks, dude. For not driving over us and stuff.\"","\n","^The other one acts similarly. \"Yeah. And for not driving over the football. Sorry.\"","\n","^\"Yah, sorry.\"","\n",{"->":"exposition"},{"#f":1}],"exposition":["^\"We <i>just</i> came back from an all-nighter. It was <i>fuuuuucking</i> crazy, dude.\"","\n","^\"Yah dude.\"","\n","^\"One of the Bigs held a massive party last night and it carried on all night. Lotsa cool people.\"","\n","^\"Lots.\"","\n",{"->":"nice"},{"#f":1}],"nice":["^\"For helping us out, we'll put in a good word for you. For <i>sure.</i>\"","\n","^Instead of continuing the chain of conversation like he had been, the one who'd been speaking in one or two word sentences shook his hand in the air. What is that, code for something? You shrug.","\n","^You go back to the van, and you brief your teammates. Lady doesn't seem exactly thrilled, but Gatorhead <i>is</i>. Leslie's Leslie.","\n","end",{"#f":1}],"uhoh":["ev",{"VAR?":"player_moxie"},1,"-",{"VAR=":"player_moxie","re":true},"/ev","^You ready your hands and fists, and as much as the guy can yell at you asking what you're doing, he cannot stop what's coming.","\n","^You ready for a good slap square on the cheek.","\n","^But somehow, you miss. Horribly. And you slap the other guy. Centrifugal force wasn't working with you here.","\n","^The guy is <i>pissed.</i> He punches you right back, square on the nose. You fall back, and that's all Gatorhead needs to run outside and drag you out of there.","\n","^Swears and yells are exchanged, which in turn wake the fainted up. He starts yelling incoherent stuff soon after, but it's well into getaway drive that you hear a <b>\"FUCKING IDIOTS! WE'LL TELL OUR BIGS FOR THIS! YOU'LL PAAAA A A A A A A Y-\"</b>","\n","end",{"#f":1}],"stay":[["^The guy's still yelling, but you're not moving a muscle. Eventually, he gets irritated enough to come all the way to your van, banging on the window repeatedly.","\n","^Lady stares you down, really trying to get you not to help them, for whatever reason. And you might oblige, before Leslie loudly whispers that cracks in the glass are starting to show.","\n","ev","str","^ Don't Open Window ","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^ Open Window ","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"noglass"},"\n",{"#f":5}],"c-1":["^ ",{"->":"window"},"\n",{"#f":5}]}],{"#f":1}],"noglass":["^Leslie eventually ends up being right even though she didn't want to be. The glass eventually starts to crack, and at that moment you whip your head around to face the guy, who has also stopped. He grins nonchalantly.","\n","^\"Ooops.\"","\n","^You open the door just a slit.","\n","^\"... Please help us out.\"","\n","^But now that he's cracked the glass, you <i>really</i> don't want to help him. And he probably recognizes that.","\n","^He slips a couple of stamps through the slit in the door. \"Here. Compensayshun.\"","\n","^You close the door shut after taking the stamps, and drive off. Where will you even fix the window with this 'compensayshun?'","\n","end",{"#f":1}],"window":["^You roll the window open before he can seriously damage it. The man's back to whining for help, somehow louder even without the window pane being an obstacle. He rushes back to his friend soon after.","\n",{"->":"help"},{"#f":1}],"setTestValue":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"testValue","re":true},{"#f":1}],"setGrenade":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"has_grenade","re":true},{"#f":1}],"setGatorHeadInParty":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"has_GatorHead","re":true},{"#f":1}],"setSamInParty":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"has_Sam","re":true},{"#f":1}],"setCharisma":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_constitution","re":true},{"#f":1}],"setWisdom":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_wisdom","re":true},{"#f":1}],"setConstitution":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_constitution","re":true},{"#f":1}],"setMoxie":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_moxie","re":true},{"#f":1}],"setGumption":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_gumption","re":true},{"#f":1}],"setFratRelationship":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"frat_relationship","re":true},{"#f":1}],"setRebelsRelationship":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"rebels_relationship","re":true},{"#f":1}],"setNeutralsRelationship":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"neutrals_relationship","re":true},{"#f":1}],"global decl":["ev",false,{"VAR=":"has_side_kick"},false,{"VAR=":"has_brick"},"str","^","/str",{"VAR=":"player_name"},"str","^","/str",{"VAR=":"puppy_kicked"},"str","^Kicked","/str",{"VAR=":"puppy_status"},false,{"VAR=":"has_GatorHead"},false,{"VAR=":"has_Sam"},0,{"VAR=":"player_constitution"},0,{"VAR=":"player_wisdom"},0,{"VAR=":"player_charisma"},0,{"VAR=":"player_moxie"},0,{"VAR=":"player_gumption"},0,{"VAR=":"neutrals_relationship"},0,{"VAR=":"frat_relationship"},0,{"VAR=":"rebels_relationship"},0,{"VAR=":"testValue"},false,{"VAR=":"has_keycard"},false,{"VAR=":"has_grenade"},"/ev","end",null],"#f":1}],"listDefs":{}}