{"inkVersion":21,"root":[["\n",{"->":"trial"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"trial":[["^There usually aren't any giant structures towering over you as you drive. <i>Usually.</i> So you're kind of startled by the sudden big shadows cast over the van. Looking up and out of your windshield, you spot a giant banner, which reads \"TRAIL\" in big letters. You think it could be random signage, but then you see \"The People vs. Twinkie Thief.\"","\n","^Huh. So it's misspelled. Though judging by the tank sitting right underneath it, you really shouldn't have been surprised. It's a SADsOP event.","\n","^You roll both windows down - at the apparent interest of your teammates, as well - and pull the curtains back in order to get a better look and listen in.","\n","^There's a podium covered in tattered flags and empty cups, and around it are over thirty buff men, all in cropped tees and baggy shorts, and with weapons hoisted on their shoulders. A man just like them is yelling on the podium.","\n","^<b>\"I DIDN'T STEAL THE TWINKIE YOU GUYS!!!! WHY WOULD I DO THAT!!!\"</b>","\n","^You can hear someone from the audience yell, <i>\"Because you're a beta cuck, Jared!\"</i> And then a <i>\"Shut up, dude!\"</i> Those are what <i>you</i> can hear anyway, but you're sure that there's more where that came from, seeing as the \"people\" look <i>pressed.</i>","\n","^This twinkie was a big deal.","\n","^<b>\"BUT I DIDN'T DO IT....\"</b>","\n","^Another man perks up from the corner of the podium, accompanied by two others - his Littles - who are each holding a big glove. \"We saw you leave the Kitchen even though you said you were going to Electrical, Jar.\"","\n","^Jared is about to pass out from how red in the face he is. \"I-I'm embarrassed that I like sweets, okay?! But I didn't eat that damn twinkie!\"","\n","^His eyes scour the audience for help, but instead of finding friendly faces in the audience, he finds them with you. He squints.","\n","ev","str","^ Stare Back ","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^ Hurry Away ","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"stare"},"\n",{"#f":5}],"c-1":["^ ",{"->":"leave"},"\n",{"#f":5}]}],{"#f":1}],"leave":["ev",3,{"x()":"causeEvent","exArgs":1},"pop","/ev","\n","^Before this Jared can even say anything, you hit the gas so hard that all of your party members fly backwards and off of their seats. You ignore their shouting - apparently Gatorhead has fallen on Leslie's foot and Lady narrowly escaped - and drive away.","\n","^Out of your rearview, you see Jared being manhandled back onto the podium. He <i>really</i> wanted you as his audience. In the end, you lose extra gas from all of that rushing.","\n","end",{"#f":1}],"stare":["^<b>\"YOU!\"</b> He points to your van, which causes the whole squadron to whip around to face you. You point to yourself, mouthing \"Me?\" Before a \"GET THEM\" is unleashed. Your party members leave the van sooner than you, and drag you with them before the SADsOP-s can lay their hands on either of you.","\n","^You drag your feet to the trial. The people have left some space for you, in the spirit of \"democracy\" and such, and the four of you stand there, silently glancing at each other. Lady is the only one who's throwing nasty glances outward, her hand on one of her holsters.","\n",{"->":"trialtime"},{"#f":1}],"trialtime":[["^\"Thanks for coming,\" the other man - not Jared - grins. \"Jared here is accused of eating the last Twinkie we had. It was our ... very last...\" His expression falls. The others put their hands on their chest in solemnity. Jared does too, until he reminds himself.","\n","^\"Hold on now! I didn't eat it! Why are you all saying I did!\"","\n","^\"You definitely did.\"","\n","^\"Bobby, what the <i>fuck</i> dude?\" Jared turns towards the other. \"We literally were chatting when the Twinkie was reported missing!\"","\n","^\"Were we? I don't remember....\"","\n","^\"<i>UGHHHHH H H H H H</i>\" Jared turns to you. \"Please help me. They're framing me! It's deffo because I said I didn't like orange-flavored alcohol!!!!!\"","\n","^You hear someone from the audience say, \"Who the hell doesn't like orange-flavored alcohol?\" And then a \"Heretic! Burn him!\" before they started clanking their weapons together, making a racket. Someone even shoots a gun in the air.","\n","^\"Not liking orange-flavored anything is a <i>sin</i>,\" Bobby says, shaking his head like a disappointed father. The Littles beside him nodded fervently. \"I'm allergic to oranges,\" one of them says before being kicked in the knee by the other one.","\n","^Lady finally looks at you after so long. Her look, just like your thoughts, mean, <i>What the fuck are they yapping about?</i> Leslie on the other hand is trying really hard to hold her laughter in. She looks red.","\n","ev","str","^ Side with the People ","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^ Side with Jared ","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"orange"},"\n",{"#f":5}],"c-1":["^ ",{"->":"twinkie"},"\n",{"#f":5}]}],{"#f":1}],"orange":["ev",14,{"x()":"causeEvent","exArgs":1},"pop","/ev","\n","ev",14,{"x()":"causeEvent","exArgs":1},"pop","/ev","\n","ev",{"VAR?":"player_gumption"},1,"-",{"VAR=":"player_gumption","re":true},"/ev","^The crowd cheers and screeches. Jared holds his face in his hands, initially not noticing two \"jailers\" come up to him and grab him by the elbows, dragging him backwards.","\n","^<b>\"NO!\"</b> He yells. <b>\"I DIDN'T DO IT, I SWE A A A A A A -\"</b> His yelling is obstructed by a punch to the nose.","\n","^Another guy approaches you and hands you crumpled up stamps, which you look at, confuddled. Gatorhead takes them from you and stuffs them in his pants' pocket. No questions asked. <i>It's like a reward.</i> (From judging someone?)","\n","^\"What are you gonna do to him?\" Someone from the audience asked.","\n","^\"Kill him,\" Bobby said, without missing a beat.","\n","^The crowd went silent, and so did your party. Leslie suddenly doesn't want to laugh anymore.","\n","^... Crickets.","\n","^\"That's too much,\" you hear, and Bobby sighs as well. \"Alright, <i>fine</i>, just a 1000 push-ups.\"","\n","^<i>Oh, that's too little, that's nothing,</i> are what you hear from the clamoring that has resumed, and before you can react, Gatorhead grabs you and the ladies and you rush your way to the van. Unable to deal with the consequences of whatever they're going to put poor Jared through.","\n","^Poor Jared. He definitely ate the twinkie though.","\n","^Right?","\n","end",{"#f":1}],"twinkie":["ev",6,{"x()":"causeEvent","exArgs":1},"pop","/ev","\n","^<b>\"THANKS, THANKS, THANKS,\"</b> Jared nearly starts convulsing on the podium, shaking his head back and forth. There's jeering, but there's cheers too. It seems that the People are easily swayed.","\n","^Bobby sighs. \"Alright, <i>fiiiine</i>, just because the Outsiders helped you out. Relax. You're scot free this time. Now you-\"","\n","^Jared is barely listening, instead bounding over to your party, hugging you tight. You feel like your bones are going to be crushed. Just as you think he's about to let go, not only does he hug you tighter, but he also slides something in your pocket.","\n","^\"They actually mis-call-kuh-layted. There were <i>two</i> twinkies,\" the man whispers. He grins as he lets you go, and walks backwards, spreading his arms.","\n","^<b>\"I STILL FUCKING HATE ORANGES!!!! RAAAHHHHHH!!!!!\"</b>","\n","^<i>That's unfair, what a heretic</i> are what you hear from the clamoring that has resumed, and before you can react, Gatorhead grabs you and the ladies and you rush your way to the van. Leslie bursts into laughter the moment you're in the van, and just for that, you give her the Twinkie to shut her up.","\n","end",{"#f":1}],"setTestValue":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"testValue","re":true},{"#f":1}],"setGatorHeadInParty":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"has_GatorHead","re":true},{"#f":1}],"setSamInParty":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"has_Sam","re":true},{"#f":1}],"setCharisma":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_constitution","re":true},{"#f":1}],"setWisdom":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_wisdom","re":true},{"#f":1}],"setConstitution":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_constitution","re":true},{"#f":1}],"setMoxie":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_moxie","re":true},{"#f":1}],"setGumption":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"player_gumption","re":true},{"#f":1}],"setFratRelationship":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"frat_relationship","re":true},{"#f":1}],"setRebelsRelationship":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"rebels_relationship","re":true},{"#f":1}],"setNeutralsRelationship":[{"temp=":"value"},"ev",{"VAR?":"value"},"/ev",{"VAR=":"neutrals_relationship","re":true},{"#f":1}],"global decl":["ev",false,{"VAR=":"has_side_kick"},false,{"VAR=":"has_brick"},"str","^","/str",{"VAR=":"player_name"},"str","^","/str",{"VAR=":"puppy_kicked"},"str","^Kicked","/str",{"VAR=":"puppy_status"},false,{"VAR=":"has_GatorHead"},false,{"VAR=":"has_Sam"},0,{"VAR=":"player_constitution"},0,{"VAR=":"player_wisdom"},0,{"VAR=":"player_charisma"},0,{"VAR=":"player_moxie"},0,{"VAR=":"player_gumption"},0,{"VAR=":"neutrals_relationship"},0,{"VAR=":"frat_relationship"},0,{"VAR=":"rebels_relationship"},0,{"VAR=":"testValue"},false,{"VAR=":"has_keycard"},false,{"VAR=":"has_grenade"},"/ev","end",null],"#f":1}],"listDefs":{}}